# Intermediate SQL

## Filtering Records

#### LIKE and NOT LIKE

The `Like` and `NOT LIKE` operators can be used to find records that either match or o not match a specified pattern, respectively. They can be coupled with the wildcards `%` and `_`. The `%` will match zero or many characters, and `_` will match a single character.

This is useful when you want to filter text, but not to an exact word.

Do the following exercise to gain some practice with these keywords.

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the names of all people whose names begin with 'B'.

In [5]:
# -- Select the names that starts with B
sql = """
SELECT name
FROM people
WHERE name LIKE 'B%'
"""
run_statement(sql)

                  0
0        B.J. Novak
1      Babak Najafi
2       Babar Ahmed
3    Bahare Seddiqi
4          Bai Ling
..              ...
440   Buster Keaton
441   Busy Philipps
442     Buzz Aldrin
443    Byron Howard
444      Byron Mann

[445 rows x 1 columns]

* Select the names of people whose names have 'r' as the second letter.

In [6]:
sql = """
SELECT name
FROM people
-- Select the names that have r as the second letter
WHERE name LIKE '_r%'
"""
run_statement(sql)

                     0
0             Ara Celi
1        Aramis Knight
2    Arben Bajraktaraj
3     Arcelia RamÃ­rez
4           Archie Kao
..                 ...
525        Troy Garity
526        Troy Miller
527         Troy Nixey
528     Ursula Andress
529      Wray Crawford

[530 rows x 1 columns]

* Selec the names of people whose names don't start with 'A'.

In [7]:
sql = """
SELECT name
FROM people
-- Select names that don't start with A
WHERE name NOT LIKE 'A%'
"""
run_statement(sql)

                          0
0                B.J. Novak
1              Babak Najafi
2               Babar Ahmed
3            Bahare Seddiqi
4                  Bai Ling
...                     ...
7763          Sharat Saxena
7764           Shari Albert
7765  Shari Springer Berman
7766         Sharlto Copley
7767         Sharon Greytak

[7768 rows x 1 columns]

* Finally, amend the query to include all Spanish-language `or` French-language films with the same criteria.

In [9]:
sql = """
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
	AND budget > 100000000
-- Amend the query to include Spanish or French-language films
	AND (language = 'Spanish' OR language = 'French')
"""
run_statement(sql)

                                         0     1
0  Les couloirs du temps: Les visiteurs II  1998
1                                    Tango  1998